astb_relise/src/Enums/ВидыВыдачиСИЗ/ВидыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВыдачиСИЗ</name>
  <enumValues>
    <name>КоллективнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПерсональнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяВыдача</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>Номенклатура для выдачи</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАнтропометрическогоСвойства</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьВидАнтропометрическогоСвойстваПриАнализе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРост</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСИЗ</name>
    <type>
      <types>CatalogRef.ВидыСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДляУчетаЧистки</name>
    <comment>Вес для учета чистки (химчистки) СИЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьКакКомплектВЗаказеПоставщикуИОтчетеДляСАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШтрихкод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеКоличествоЦикловЧистки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровМеньше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровБольше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможнаАвтоматизированнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматизированнаяВыдачаБезОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриФормированииЗаказовПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьНаХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСбыта</name>
    <type>
      <types>EnumRef.СтатусыСбыта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаКомплектаДляППС</name>
    <type>
      <types>EnumRef.ВидыУчетаКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркированнойНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыМаркированнойНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаХранения</name>
    <type>
      <types>CatalogRef.ТочкиХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодлежитУтилизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляПримеркиВTexel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРоста</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГОСТы</name>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>CatalogRef.ГОСТы</types>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/CommonModules/Алгоритм_1_0_1_1_Клиент/Module.bsl
#Область ИнтерфейсДокументаВыдачиСИЗ

Процедура ВыдачаСИЗ_ТоварыНеВыданоПриИзменении(Элемент,ТекущийОбъект,ФормаДокумента) Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы.Товары.ТекущиеДанные;
	
	//СтруктураТекущихДанных = ПроцедурыРаботыСНормамиКлиент.ПеренестиТекущиеДанныеВыдачиВСтруктуру(ТекущиеДанные);
	
	Если ТекущиеДанные.НеВыдано Тогда
		ТекущиеДанные.Номенклатура 					= ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		ТекущиеДанные.ХарактеристикаНоменклатуры 	= ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		ТекущиеДанные.Цена 							= 0;
		ТекущиеДанные.Сумма 						= 0;
		ТекущиеДанные.КоличествоВКомплекте			= 0;
		ТекущиеДанные.Количество					= 0;
		ТекущиеДанные.ВыдачаСверхНорм				= Ложь;
	Иначе
		ТекущиеДанные.НеВыданоПоПричине = ПредопределенноеЗначение("Справочник.ПричиныНевыдачиСИЗ.ПустаяСсылка");
		Если ТекущиеДанные.Количество = 0 Тогда
			ТекущиеДанные.Количество = ТекущиеДанные.КоличествоПотребность;
			ПроцедурыРаботыСНормамиКлиент.СкорректироватьКоличествоКомплектующих(ТекущиеДанные.НормаВыдачи,ТекущиеДанные.Номенклатура,ТекущиеДанные.Количество,ТекущийОбъект);
		КонецЕсли;
		//Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		//	ТекущиеДанные.Цена 	= ЦенообразованиеСерверПереопределяемый.ПолучитьЦену(ТекущиеДанные.Номенклатура,ТекущийОбъект.Организация,ТекущийОбъект.Дата);
		//	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
		//КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.Цена 	= ЦенообразованиеСерверПереопределяемый.ПолучитьЦену(ТекущиеДанные.Номенклатура,ТекущийОбъект.Организация,ТекущийОбъект.Дата);
		ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	КонецЕсли;
		
	СтруктураТекущихДанных = ПроцедурыРаботыСНормамиКлиент.ПеренестиТекущиеДанныеВыдачиВСтруктуру(ТекущиеДанные);
	
	Если ТекущиеДанные.КоличествоСовпаденийНоменклатурыНормы > 1 Тогда
		ФормаДокумента.СкорректироватьСовпадающиеСтроки(СтруктураТекущихДанных,Истина,Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Комплект) Тогда
		ФормаДокумента.СкорректироватьКомплекты(СтруктураТекущихДанных);
	КонецЕсли;
		
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры

//АсТБ_Alexey_102437_********************************************************************

Процедура ВыдачаСИЗ_ОбработатьСтрокуПоНевыдано(СтрокаТаблицы,ТекущийОбъект,ФормаДокумента) Экспорт
	
	СтруктураТекущихДанных = ПроцедурыРаботыСНормамиКлиент.ПеренестиТекущиеДанныеВыдачиВСтруктуру(СтрокаТаблицы);
	
	СтрокаТаблицы.Номенклатура 					= ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	СтрокаТаблицы.ХарактеристикаНоменклатуры 	= ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	СтрокаТаблицы.Цена 							= 0;
	СтрокаТаблицы.Сумма 						= 0;
	СтрокаТаблицы.Количество					= 0;
	СтрокаТаблицы.КоличествоВКомплекте			= 0;
	СтрокаТаблицы.ВыдачаСверхНорм				= Ложь;
	
	Если СтрокаТаблицы.КоличествоСовпаденийНоменклатурыНормы > 1 Тогда
		ФормаДокумента.СкорректироватьСовпадающиеСтроки(СтруктураТекущихДанных,Истина,Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.Комплект) Тогда
		ФормаДокумента.СкорректироватьКомплекты(СтруктураТекущихДанных);
	КонецЕсли;
		
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");	
	
КонецПроцедуры

//АсТБ_Alexey_102437_********************************************************************

Процедура ВыдачаСИЗ_ТоварыНеВыданоПоПричинеПриИзменении(Элемент,ТекущийОбъект,ФормаДокумента) Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы.Товары.ТекущиеДанные;	
	
	Если НЕ ТекущиеДанные.НеВыдано Тогда
		ТекущиеДанные.НеВыданоПоПричине = ПредопределенноеЗначение("Справочник.ПричиныНевыдачиСИЗ.ПустаяСсылка");			
	КонецЕсли;
	
	Если ТекущиеДанные.КоличествоСовпаденийНоменклатурыНормы > 1 Тогда
		СтруктураТекущихДанных = ПроцедурыРаботыСНормамиКлиент.ПеренестиТекущиеДанныеВыдачиВСтруктуру(ТекущиеДанные);
		ФормаДокумента.СкорректироватьСовпадающиеСтроки(СтруктураТекущихДанных,Ложь,Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыдачаСИЗ_ТоварыНоменклатураНормыПриИзменении(Элемент,ТекущийОбъект,ФормаДокумента) Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы.Товары.ТекущиеДанные;	
	
	СтруктураТекущихДанных = ПроцедурыРаботыСНормамиКлиент.ПеренестиТекущиеДанныеВыдачиВСтруктуру(ТекущиеДанные);
		
	ФормаДокумента.ОбработатьИзменениеНоменклатурыНормыНаСервере(СтруктураТекущихДанных);
		
КонецПроцедуры

Процедура ВыдачаСИЗ_ТоварыНоменклатураПриИзменении(Элемент,ТекущийОбъект,ФормаДокумента) Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы.Товары.ТекущиеДанные;	
	
	//для произвольной выдачи размер по антропометрии не подбирается
	Если НЕ (ТекущийОбъект.ВидВыдачиСИЗ = ПредопределенноеЗначение("Перечисление.ВидыВыдачиСИЗ.ПроизвольнаяВыдача") ИЛИ ТекущийОбъект.ВидВыдачиСИЗ = ПредопределенноеЗначение("Перечисление.ВидыВыдачиСИЗ.УпрощеннаяВыдача")) Тогда
		ТекущиеДанные.ХарактеристикаНоменклатуры = ПроцедурыРаботыСНормамиСервер.ПолучитьХарактеристикуПоАнтропометрии(ТекущиеДанные.Номенклатура,ТекущиеДанные.Сотрудник);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.Цена 	= ЦенообразованиеСерверПереопределяемый.ПолучитьЦену(ТекущиеДанные.Номенклатура,ТекущийОбъект.Организация,ТекущийОбъект.Дата);
		ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	Иначе
		ТекущиеДанные.Цена 	= 0;
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
	
	Если ТекущиеДанные.КоличествоСовпаденийНоменклатурыНормы > 1 Тогда
		СтруктураТекущихДанных = ПроцедурыРаботыСНормамиКлиент.ПеренестиТекущиеДанныеВыдачиВСтруктуру(ТекущиеДанные);
		ФормаДокумента.СкорректироватьСовпадающиеСтроки(СтруктураТекущихДанных,Ложь,Ложь);	
	КонецЕсли;
	
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");	
	
КонецПроцедуры

Процедура ВыдачаСИЗ_ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент,ТекущийОбъект,ФормаДокумента) Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы.Товары.ТекущиеДанные;	
	
	Если ТекущиеДанные.КоличествоСовпаденийНоменклатурыНормы > 1 Тогда
		СтруктураТекущихДанных = ПроцедурыРаботыСНормамиКлиент.ПеренестиТекущиеДанныеВыдачиВСтруктуру(ТекущиеДанные);
		ФормаДокумента.СкорректироватьСовпадающиеСтроки(СтруктураТекущихДанных,Ложь);	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыдачаСИЗ_ТоварыКоличествоПриИзменении(Элемент,ТекущийОбъект,ФормаДокумента) Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы.Товары.ТекущиеДанные;	
	
	Если НЕ ТекущийОбъект.ВидВыдачиСИЗ = ПредопределенноеЗначение("Перечисление.ВидыВыдачиСИЗ.ПроизвольнаяВыдача") Тогда
		
		ИдентификаторТекущейСтроки 		= ТекущиеДанные.ПолучитьИдентификатор();
		ИдентификаторМаксимальнойСтроки = ФормаДокумента.ПолучитьИдентификаторСтрокиСМаксимальнойПотребностью(ИдентификаторТекущейСтроки);
		
		ТекущееКоличество = ТекущиеДанные.Количество;
		
		Если НЕ ИдентификаторТекущейСтроки = ИдентификаторМаксимальнойСтроки Тогда
			ТекущиеДанные = ТекущийОбъект.Товары.НайтиПоидентификатору(ИдентификаторМаксимальнойСтроки);
		КонецЕсли;
		
		ТекущиеДанные.Количество = ТекущееКоличество;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Комплект) Тогда
		ПроцедурыРаботыСНормамиКлиент.СкорректироватьКоличествоКомплектующих(ТекущиеДанные.НормаВыдачи,ТекущиеДанные.Комплект,ТекущиеДанные.Количество,ТекущийОбъект);
		ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена * ТекущиеДанные.КоличествоВКомплекте;
	Иначе
		Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
			ТекущиеДанные.Цена 	= ЦенообразованиеСерверПереопределяемый.ПолучитьЦену(ТекущиеДанные.Номенклатура,ТекущийОбъект.Организация,ТекущийОбъект.Дата);
			ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
		Иначе
			ТекущиеДанные.Цена 	= 0;
			ТекущиеДанные.Сумма = 0;
		КонецЕсли;
		//ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	КонецЕсли;
	
	Если ТекущиеДанные.КоличествоСовпаденийНоменклатурыНормы > 1 Тогда
		СтруктураТекущихДанных = ПроцедурыРаботыСНормамиКлиент.ПеренестиТекущиеДанныеВыдачиВСтруктуру(ТекущиеДанные);
		ФормаДокумента.СкорректироватьСовпадающиеСтроки(СтруктураТекущихДанных,Истина);	
	КонецЕсли;
	
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");	
	
КонецПроцедуры

Процедура ВыдачаСИЗ_ТоварыПередНачаломИзменения(Элемент,ТекущийОбъект,ФормаДокумента,Отказ) Экспорт
	
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыНеВыдано" ИЛИ  Элемент.ТекущийЭлемент.Имя = "ТоварыНеВыданоПоПричине" Тогда 
		//если есть строки, добавленные копированием, запрещаем редактирование невыдачи
		Если ФормаДокумента.ЕстьСкопированныеСтроки(Элемент.ТекущиеДанные.НормаВыдачи) Тогда
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатураНормы" Тогда
		//для разобранных комплектов номенклатура нормы не редактируется
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Комплект) Тогда 
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатура" Тогда
		//для разобранных комплектов номенклатура не редактируется
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Комплект) Тогда 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсДокументаЗаявкаНаВыдачу

Процедура ЗаявкаНаВыдачу_ТоварыНоменклатураНормыПриИзменении(Элемент,ТекущийОбъект,ФормаДокумента) Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.Номенклатура 					= ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	ТекущиеДанные.ХарактеристикаНоменклатуры 	= ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	
КонецПроцедуры

Процедура ЗаявкаНаВыдачу_ТоварыНоменклатураПриИзменении(Элемент,ТекущийОбъект,ФормаДокумента) Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.ХарактеристикаНоменклатуры = ПроцедурыРаботыСНормамиСервер.ПолучитьХарактеристикуПоАнтропометрии(ТекущиеДанные.Номенклатура,ТекущиеДанные.Сотрудник);
	
КонецПроцедуры

Процедура ЗаявкаНаВыдачу_ТоварыПередНачаломИзменения(Элемент,ТекущийОбъект,ФормаДокумента,Отказ) Экспорт
	
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатураНормы" Тогда //для данного алгоритма номенклатура нормы не редактируется
		Отказ = Истина;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатура" Тогда
		//для разобранных комплектов номенклатура не редактируется
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Комплект) Тогда 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсДокументаСписанияВыданныхСИЗ

Процедура СписаниеСИЗ_УправлениеДоступностью(ФормаДокумента) Экспорт
	
	ФормаДокумента.Элементы.ТоварыКоличество.Доступность = Ложь;
	ФормаДокумента.Элементы.ТоварыКоличество.ТолькоПросмотр = Истина;
	
КонецПроцедуры

#КонецОбласти
